In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/zekelabs/machine-learning-for-beginners/master/data/titanic-train.csv',index_col='PassengerId')

In [3]:
df.groupby('Sex').Age.mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [5]:
df.groupby('Sex').describe()

          Age                                                       Fare  \
        count       mean        std   min   25%   50%   75%   max  count
Sex
female  261.0  27.915709  14.110146  0.75  18.0  27.0  37.0  63.0  314.0
male    453.0  30.726645  14.678201  0.42  21.0  29.0  39.0  80.0  577.0

                  ...  SibSp      Survived                                     \
             mean ...    75%  max    count      mean       std  min  25%  50%
Sex               ...
female  44.479818 ...    1.0  8.0    314.0  0.742038  0.438211  0.0  0.0  1.0
male    25.523893 ...    0.0  8.0    577.0  0.188908  0.391775  0.0  0.0  0.0


        75%  max
Sex
female  1.0  1.0
male    0.0  1.0

[2 rows x 48 columns]

In [6]:
df.groupby('Survived').Age.mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [14]:
df_n = pd.DataFrame({'s1':[1,2,3,4,5,6],'s2':[5,6,7,8,9,11]})
df_n

   s1  s2
0   1   5
1   2   6
2   3   7
3   4   8
4   5   9
5   6  11

In [15]:
df_n.rolling(window=3,min_periods=1).mean()

    s1        s2
0  1.0  5.000000
1  1.5  5.500000
2  2.0  6.000000
3  3.0  7.000000
4  4.0  8.000000
5  5.0  9.333333